---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures.ViewOnASheetMustBeUniqueWarn
source: html/a36e4235-fe13-279e-1f70-304a93d87cd1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures.ViewOnASheetMustBeUniqueWarn Property

Sheet views cannot contain more than one instance of "%1!s!."

## Syntax (C#)
```csharp
public static FailureDefinitionId ViewOnASheetMustBeUniqueWarn { get; }
```